app/controllers/books_controller.rb

		def index
			if params[:category].blank?
				@books = Book.all.order("created_at DESC")
			else
				@category_id = Category.find_by(name: params[:category]).id
				@books = Book.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Technology"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ? ORDER BY created_at DESC  [["category_id", 2]]

		def show
			if @book.reviews.blank?
				@average_review = 0
			else
				@average_review = @book.reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 7]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 7]]

		def new
			@book = current_user.books.build
			@categories = Category.all.map{ |c| [c.name, c.id]}
---
SELECT "categories".* FROM "categories"

		def create
			@book = current_user.books.build(book_params)
			@book.category_id = params[ :category_id]

			if @book.save
---
INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "How to Run"], ["description", "Describes how to run"], ["author", "Pappan"], ["created_at", "2018-06-25 00:13:02.472436"], ["updated_at", "2018-06-25 00:13:02.472436"]]

		def update
			@book.category_id = params[ :category_id]
			if @book.update(book_params)
---
UPDATE "books" SET "book_img_file_size" = ?, "book_img_updated_at" = ?, "updated_at" = ?, "book_img_file_name" = ? WHERE "books"."id" = ?  [["book_img_file_size", 48095], ["book_img_updated_at", "2018-06-29 20:12:58.732344"], ["updated_at", "2018-06-29 20:12:59.804632"], ["book_img_file_name", "meso.jpg"], ["id", 4]]