app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "Good"], ["created_at", "2018-06-30 18:22:30.268433"], ["updated_at", "2018-06-30 18:22:30.268433"], ["user_id", 1], ["book_id", 7]]
---
	def create
		@review = Review.new(review_params)
		@review.book_id = @book.id
		@review.user_id = current_user.id

		if @review.save

UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "Goodbbbb"], ["updated_at", "2018-07-01 14:35:49.700653"], ["id", 1]]
---
	def update

		if @review.update(review_params)